<template>
  <section class="why" id="why">
    <h2 class="why__title">Неге ойындар арқылы оқу — керемет?</h2>
    <div class="container why__content">
      <div class="why__content-img">
        <img src="@/assets/images/why.webp" alt="" />
      </div>
      <div class="why__items">
        <div class="why__item">
          <h3 class="why__item-title">✨ Қызықты оқу — тиімді оқу!</h3>
          <p class="why__item-txt">
            Балалар ойнағанда көбірек есте сақтайды. Ойындар оқуды қызықты
            оқиғаға айналдырады, зейінділік, логика және қызығушылықты дамытады!
          </p>
        </div>
        <div class="why__item">
          <h3 class="why__item-title">🎮 Ойындар — мотивация көзі</h3>
          <p class="why__item-txt">
            Ойында бала "міндет үшін" емес, қызығушылық үшін оқып жатқанын
            сезінеді. Ұпайлар, деңгейлер мен жетістіктер әрі қарай ұмтылуға
            шабыттандырады.
          </p>
        </div>
        <div class="why__item">
          <h3 class="why__item-title">🧩 Ойлауды дамыту</h3>
          <p class="why__item-txt">
            Ойындар логика, стратегия және зейінділікті талап етеді. Бұл
            балаларға материалды жақсы түсінуге және оны өмірде қолдануға
            көмектеседі.
          </p>
        </div>
        <div class="why__item">
          <h3 class="why__item-title">🚀 Интерактивтілік = белсенділік</h3>
          <p class="why__item-txt">
            Бала материалмен әрекеттескен кезде — басқанда, таңдағанда,
            сүйрегенде, біріктіргенде — ол тез әрі қызығушылықпен оқиды.
          </p>
        </div>
      </div>
    </div>
  </section>
</template>

<script setup>

</script>